import requests
import json
import pandas as pd

fish = input('請輸入魚貨名稱： ')
url = 'https://data.coa.gov.tw/Service/OpenData/FromM/AquaticTransData.aspx'

getPage = lambda x: requests.get(x).text
j = json.loads(getPage(url))

list = []
for x in j:
    if x['魚貨名稱'] == fish:
        list.append(x)

df = pd.DataFrame.from_dict(list)
print(df)
df.to_csv('fish.csv')

print(df.describe())



all_item = ['鮟鱇魚', '干貝凍', '下雜魚', '金線', '黃鰭鮪', '加臘', '鯁魚', '目斗', '其他鮪魚', '其他鯊魚', '咬狗', '黑鯧', '蜆(養)', '牡蠣養', '白鯛', '泰國蝦養', '暑魚凍', '勿仔(凍)', '加志', '油魽凍', '其他旗魚(凍)', '（日本）白帶魚凍', '圓花鰹', '尼羅紅魚', '魚肚', '紅蝦海', '白北(凍)', '比目魚片', '海鯰', '吳郭魚', '海瓜子', '土剎', '蟳', '銀花鱸', '目孔', '圓鱈片', '紅鰽海', '皮刀', '金龍、石鱸', '其他頭足', '西齒', '白口', '竹蟶海', '加州鱸', '龍尖、青嘴', '赤宗', '劍旗魚凍', '其他養殖', '赤海', '熟鯖魚', '烏仔魚', '其他熟魚', '大眼鮪', '銀鯧', '鱙仔(凍)', '西鯧', '虱目魚頭', '赤筆', '石喬(凍)', '其他貝類', '白蝦', '花市仔', '花身', '紅尾蝦海', '巴鰹、三點仔', '蜊(養)', '鮭魚頭/尾', '烏鰡', '厚殼蝦海', '水針', '鐵甲', '尖梭', '黑鯛', '紅皮刀凍', '金目鱸', '黑尾冬', '美軟魚、大面側仔', '午仔魚', '三牙', '扁魚', '海鰻', '草蝦養', '黑口', '肉魚(凍)', '闊北', '鮭魚(凍)', '其他鰹類', '肉魚', '馬頭魚(凍)', '其他鰻類', '軟舌、軟絲', '圓鱈', '白鯧', '四破', '紅尾冬', '沙煙(凍)', '其他鮪魚(凍)', '肉栓', '剝皮魚', '黑皮旗凍', '象魚(臭肚)', '鯊條', '三角仔、金錢仔【養】', '丁香(凍)', '其他凍結(凍)', '赤翅', '黑皮刀(凍)', '三角仔', '鯖魚(凍)', '黃臘鰺(紅杉)', '油魚', '軟舌', '紅尾蝦養', '大鯊【凍】', '鱒魚', '水鯊凍', '紅魚', '烏公(台中)', '尖梭(凍)', '翻車魚肉', '白北', '七星鱸', '青魽', '劍旗魚', '白秋蝦海', '黑皮旗', '龍膽石斑', '赤宗(凍)', '其他鰺類', '牛尾', '魚卵', '馬加沙', '秋哥', '大冇蝦', '白松', '角蝦、鐵甲蝦', '熟丁香', '虱目魚肚', '水鯊', '丁香', '剝皮魚（黑達仔）', '大眼鮪凍', '秋刀(凍)', '鮭魚', '沙腸', '黑鯊(凍)', '蘆蝦海', '紅喉', '紅鰽', '角鯊', '其他蟹類', '田蛙', '翻車魚', '旗魚肉', '柳葉魚(凍)', '長鰭鮪', '小卷', '草魚', '紅目鰱', '鳳螺(海)', '鮭魚頭/尾凍', '豆仔', '沙蝦海', '黑鮪凍', '油魽', '加鱲', '黃鰭鮪凍', '其他加工', '鮭魚片', '鮸魚', '黃鍚鯛', '魷魚(凍)', '墨魚賊', '紅蟳', '文蛤(海)', '石狗公', '長角鬥士赤蝦', '大正蝦海', '黑鮪', '其他沙魚(凍)', '軟舌、軟絲(凍)', '甲魚', '甘瓜仔', '青斑', '其他非凍結魚', '紅條(凍)', '魷魚', '花蚧子', '其他頭足(凍)', '蝦母、東方異腕蝦', '市仔管', '三點仔', '暑魚', '鹹魚', '紅喉凍', '鯖魚', '紅肉旗(凍)', '沙翅(凍)', '小卷(凍)', '透抽(凍)', '鯽魚', '大頭鰱', '九岩', '紅新娘', '黑鮪肉', '智仔', '馬頭魚', '草蝦海', '大鯊', '海菜', '剝皮魚去頭【凍】', '白皮旗(凍)', '青鞭', '其他鯧類(凍)', '比目魚、扁鱈', '魚腸(凍)', '金龍', '變身苦', '香魚(凍)', '白鰻', '油口', '花枝', '豆仔魚', '蝦姑海', '厚唇', '透抽', '烏鞭', '煙仔虎', '其他鯛類', '三角仔【養】', '黑皮刀', '待訂', '蝦猴海', '長鰭鮪凍', '龍舌', '龍舌(凍)', '土魠(凍)', '秋姑', '小紅鱠', '土魠', '長加', '石斑魚', '虱目魚', '香魚', '真鰹', '比目魚', '小蝦海', '花枝(凍)', '紅肉旗', '泥鰍', '斑節蝦海', '其他', '魚皮', '鯊煙', '海鱺', '鱙仔', '國光、角仔魚', '花鰹', '火燒蝦', '狗母', '英哥', '石斑魚(凍)', '其他旗魚', '蝦仁', '龍蝦海', '飛魚', '其他吳郭', '盤仔', '象魚、臭肚', '魚丸', '青衣', '鰺魚', '馬加', '石喬', '紅鰱魚', '淡水珍珠石斑', '白鯧(凍)', '熟卷', '其他鰮類', '其他鯉類', '（日本）白帶魚', '牛角蟹、黃金蟹', '其他鯧類', '雨傘旗', '魚肉', '雙髻鮫', '烏母', '軟舌(凍)', '紅古', '鯰魚', '雨傘旗(凍)', '鯉魚', '白丁蝦、日本玻璃蝦', '珍珠龍膽/龍虎斑', '章魚', '鱝(魴仔)', '富貴魚、燕鯧', '胭脂蝦', '富貴魚', '章魚(凍)', '象魚', '青筆、雞仔魚', '文蛤養', '石蟳', '盤仔(凍)', '小串仔', '火口', '其他蝦類', '鱺魚', '紅尾', '鐘螺(海)', '墨魚賊(凍)', '馬加沙凍', '白皮旗', '萬引', '硬尾', '劍蝦', '油魚(凍)', '溪蝦', '巴闌', '勿仔', '黃花', '什魚(凍)', '真鰹(凍)', '三角仔、金錢仔', '魚內臟', '紅魽', '什魚', '大目仔']
